Repository: pingfangx/TranslatorX-other
Catalog: PEPs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A DSL for specifying signatures, annotations and argument converters
zh_cn: 用于指定签名，注释和参数转换器的 DSL

source: A Database of Installed Python Packages
zh_cn: 已安装 Python 包的数据库

source: A Function for testing approximate equality
zh_cn: 用于测试近似相等的函数

source: A Logging System
zh_cn: 记录系统

source: A ModuleSpec Type for the Import System
zh_cn: 导入系统的 ModuleSpec 类型

source: A New C-API for Thread-Local Storage in CPython
zh_cn: CPython 中线程本地存储的新 C-API

source: A Platform Tag for Portable Linux Built Distributions
zh_cn: 便携式 Linux 构建发行版的平台标签

source: A Switch/Case Statement
zh_cn: Switch/Case 语句

source: A Type Hierarchy for Numbers
zh_cn: 数字的类型层次结构

source: A Unified TLS API for Python
zh_cn: Python 的统一 TLS API

source: A build-system independent format for source trees
zh_cn: 源树的构建系统独立格式

source: A circuit breaking protocol and binary operators
zh_cn: 一个断路协议和二元运算符

source: A dedicated infix operator for matrix multiplication
zh_cn: 用于矩阵乘法的专用中缀运算符

source: A method for exposing a length hint
zh_cn: 暴露长度提示的方法

source: A protocol for delegating datetime methods to their
zh_cn: 将日期时间方法委托给他们的协议

source: A standard mechanism for backward compatibility
zh_cn: 一个标准的向后兼容机制

source: ABI version tagged .so files
zh_cn: ABI 版本标记 .so 文件

source: API for Block Encryption Algorithms v1.0
zh_cn: 块加密算法的 API v1.0

source: API for Cryptographic Hash Functions
zh_cn: 加密哈希函数的 API

source: API for Cryptographic Hash Functions v2.0
zh_cn: 加密哈希函数的 API v2.0

source: API for code transformers
zh_cn: 代码转换器的 API

source: Abandoned, Withdrawn, and Rejected PEPs
zh_cn: 放弃，撤回和拒绝的 PEPs

source: Accepted PEPs (accepted; may not be implemented yet)
zh_cn: 已接受的 PEPs （已接受;可能尚未实施）

source: Access to Current Module/Class/Function
zh_cn: 访问当前模块/类/功能

source: Access to Names in Outer Scopes
zh_cn: 在外部范围访问名称

source: Add __getdescriptor__ method to metaclass
zh_cn: 添加 __getdescriptor__ 方法到元类

source: Add ``math.tau``
zh_cn: 添加 ``math.tau``

source: Add a "while" clause to generator expressions
zh_cn: 为生成器表达式添加一个 "while" 子句

source: Add a frozendict builtin type
zh_cn: 添加一个 frozendict 内建类型

source: Add a new UTF-8 Mode
zh_cn: 添加一个新的 UTF-8 模式

source: Add a new tracemalloc module to trace Python memory allocations
zh_cn: 添加一个新的 tracemalloc 模块来跟踪 Python 内存分配

source: Add binary interpolation and formatting
zh_cn: 添加二进制插值和格式

source: Add new APIs to customize Python memory allocators
zh_cn: 添加新的 API 来自定义 Python 内存分配器

source: Add new time functions with nanosecond resolution
zh_cn: 添加新的以纳秒为单位的时间函数

source: Adding % formatting to bytes and bytearray
zh_cn: 将 % 格式添加到字节和字节数组中

source: Adding A Secrets Module To The Standard Library
zh_cn: 添加一个秘密模块到标准库

source: Adding A Statistics Module To The Standard Library
zh_cn: 将统计模块添加到标准库

source: Adding Roman Numeral Literals to Python
zh_cn: 将罗马数字文字添加到 Python

source: Adding a Rational Literal to Python
zh_cn: 添加一个 Rational Literal 到 Python

source: Adding a Rational Type to Python
zh_cn: 添加一个 Rational 类型到 Python

source: Adding a bool type
zh_cn: 添加一个布尔类型

source: Adding a bytes Object Type
zh_cn: 添加一个字节对象类型

source: Adding a file system path protocol
zh_cn: 添加文件系统路径协议

source: Adding a frame evaluation API to CPython
zh_cn: 将框架评估 API 添加到 CPython

source: Adding a key-transforming dictionary to collections
zh_cn: 将 key 转换字典添加到集合

source: Adding an Assignment Expression
zh_cn: 添加一个赋值表达式

source: Adding an Enum type to the Python standard library
zh_cn: 将一个 Enum 类型添加到 Python 标准库中

source: Adding an ordered dictionary to collections
zh_cn: 将一个有序的字典添加到集合

source: Adding structured data to built-in exceptions
zh_cn: 将结构化数据添加到内置异常

source: Adding sys.implementation
zh_cn: 添加 sys.implementation

source: Addition of the multiprocessing package to the standard library
zh_cn: 将多处理包添加到标准库中

source: Additional Unpacking Generalizations
zh_cn: 附加解包概括

source: Advanced String Formatting
zh_cn: 高级字符串格式

source: Allow BlockingIOError in security sensitive APIs
zh_cn: 在安全敏感的 API 中允许 BlockingIOError

source: Allow str() to return unicode strings
zh_cn: 允许 str() 返回 unicode 字符串

source: Allowing Any Object to be Used for Slicing
zh_cn: 允许任何对象用于切片

source: Although never is often better than *right* now.
zh_cn: 但是现在就做还是要好过一直不做。

source: Although practicality beats purity.
zh_cn: 尽管实用性胜过于纯粹性。

source: Although that way may not be obvious at first unless you're Dutch.
zh_cn: 虽然这种方式起初可能并不太直观，除非你是荷兰人。

source: Anonymous Block Statements
zh_cn: 匿名块声明

source: Asynchronous Comprehensions
zh_cn: 异步解析

source: Asynchronous Generators
zh_cn: 异步生成器

source: Asynchronous I/O For subprocess.Popen
zh_cn: subprocess.Popen 的 异步 I/O

source: Asynchronous IO support
zh_cn: 异步 IO 支持

source: Attribute Access Handlers
zh_cn: 属性访问处理程序

source: Attribute Docstrings
zh_cn: 属性 Docstrings

source: Augmented Assignments
zh_cn: 增强分配

source: BList: A Faster List-like Type
zh_cn: BList：更快的列表类型

source: Back to the __future__
zh_cn: 回到 __future__

source: Backport ensurepip (PEP 453) to Python 2.7
zh_cn: 向 Python 2.7 反向保证（PEP 453）

source: Backport ssl.MemoryBIO and ssl.SSLObject to Python 2.7
zh_cn: 将 ssl.MemoryBIO 和 ssl.SSLObject 反向移植到 Python 2.7

source: Backward Compatibility for the Python 2 Standard Library
zh_cn: Python 2 标准库的向后兼容性

source: Backwards Compatibility Policy
zh_cn: 向后兼容性策略

source: Beautiful is better than ugly.
zh_cn: 优美优于丑陋。

source: Bug Fix Releases
zh_cn: Bug 修复版本

source: Build system abstraction for pip/conda etc
zh_cn: 为 pip/conda 等构建系统抽象

source: Built-in noop()
zh_cn: 内置 noop()

source: Bytes literals in Python 3000
zh_cn: Python 3000 中的字节文字

source: CSV File API
zh_cn: CSV 文件 API

source: Catching Exceptions in Python 3000
zh_cn: 在 Python 3000 中捕捉异常

source: Chain exceptions at C level
zh_cn: C 级别的连锁异常

source: Change StopIteration handling inside generators
zh_cn: 更改生成器内的 StopIteration 处理

source: Change Windows console encoding to UTF-8
zh_cn: 将 Windows 控制台编码更改为 UTF-8

source: Change Windows filesystem encoding to UTF-8
zh_cn: 将 Windows 文件系统编码更改为 UTF-8

source: Change the Meaning of ``\x`` Escapes
zh_cn: 更改 ``\x`` 转义的含义

source: Changing the Division Operator
zh_cn: 更改除法运算符

source: Changing the version comparison module in Distutils
zh_cn: 更改 Distutils 中的版本比较模块

source: Choosing a distributed VCS for the Python project
zh_cn: 为 Python 项目选择分布式 VCS

source: Cleaning out sys and the "interpreter" module
zh_cn: 清除 sys 和 "interpreter" 模块

source: Code Migration and Modernization
zh_cn: 代码迁移和现代化

source: Codec Error Handling Callbacks
zh_cn: 编解码器错误处理回调

source: Coercing the legacy C locale to a UTF-8 based locale
zh_cn: 将传统的 C 语言环境强制转换为基于 UTF-8 的语言环境

source: Collecting information about git
zh_cn: 收集有关 git 的信息

source: Compatibility Tags for Built Distributions
zh_cn: 构建分布的兼容性标签

source: Complex is better than complicated.
zh_cn: 复杂优于凌乱。

source: Conditional Expressions
zh_cn: 条件表达式

source: Context Variables
zh_cn: 上下文变量

source: Context-local variables (contextvars)
zh_cn: 上下文局部变量(contextvars)

source: Copyable Iterators
zh_cn: 可复制的迭代器

source: Core development workflow automation for CPython
zh_cn: CPython 的核心开发工作流程自动化

source: Core support for typing module and generic types
zh_cn: 核心支持打字模块和泛型类型

source: Coroutines via Enhanced Generators
zh_cn: 通过增强型生成器的协程

source: Coroutines with async and await syntax
zh_cn: 具有异步和等待语法的协程

source: Creating forge.python.org
zh_cn: 创建 forge.python.org

source: Data Classes
zh_cn: 数据类

source: Database of Installed Python Distributions
zh_cn: 安装的 Python 发行版数据库

source: Date/Time Parsing and Formatting
zh_cn: 日期/时间解析和格式化

source: Decimal Data Type
zh_cn: 十进制数据类型

source: Decorators for Functions and Methods
zh_cn: 函数和方法的装饰器

source: Deferred PEPs
zh_cn: 推迟的 PEP

source: Defined semantics for locals()
zh_cn: 为 locals() 定义的语义

source: Defining Python Source Code Encodings
zh_cn: 定义 Python 源代码编码

source: Defining a Stable ABI
zh_cn: 定义一个稳定的 ABI

source: Delineation of the main module
zh_cn: 主模块的描述

source: Dependency specification for Python Software Packages
zh_cn: Python 软件包的依赖规范

source: Deprecate codecs.StreamReader and codecs.StreamWriter
zh_cn: 弃用 codecs.StreamReader 和 codecs.StreamWriter

source: Deprecation of Standard Modules
zh_cn: 标准模块的弃用

source: Design of the CPython Compiler
zh_cn: CPython 编译器的设计

source: Deterministic cleanup for iterators
zh_cn: 迭代器的确定性清理

source: Deterministic pycs
zh_cn: 确定性的 pycs

source: Dict Comprehensions
zh_cn: 字典解析

source: Dictionary-Based Configuration For Logging
zh_cn: 用于记录的基于字典的配置

source: Display Hook for Interactive Use
zh_cn: 显示挂钩交互使用

source: Distributing a Subset of the Standard Library
zh_cn: 分发标准库的一个子集

source: Distributing and Packaging Type Information
zh_cn: 分发和包装类型信息

source: Docstring Conventions
zh_cn: 文档字符串约定

source: Docstring Format
zh_cn: 文档字符串格式

source: Docstring Processing System Framework
zh_cn: 文档字符串处理系统框架

source: Docutils Design Specification
zh_cn: Docutils 设计规范

source: Doing Python Micro Releases
zh_cn: 做 Python 微型版本

source: Doing Python Releases 101
zh_cn: 制做 Python Releases 101

source: Dot Notation Assignment In Function Header
zh_cn: 函数标题中的点符号分配

source: Easier suppression of file descriptor inheritance
zh_cn: 更容易抑制文件描述符的继承

source: Easter Egg
zh_cn: 复活节彩蛋

source: Elimination of PYO files
zh_cn: 消除 PYO 文件

source: Enabling certificate verification by default for stdlib http clients
zh_cn: 默认为 stdlib http 客户端启用证书验证

source: Enhanced Argument Tuples
zh_cn: 增强的参数元组

source: Enhanced While Loop
zh_cn: 增强 While 循环

source: Enumerations in Python
zh_cn: Python 中的枚举

source: Environment Markers
zh_cn: 环境标记

source: Errors should never pass silently.
zh_cn: 错误绝不能悄悄忽略。

source: Exception Chaining and Embedded Tracebacks
zh_cn: 异常链接和嵌入式回溯

source: Exception Reorganization for Python 3.0
zh_cn: Python 3.0 的异常重组

source: Exception-catching expressions
zh_cn: 捕获异常的表达式

source: Executing modules as scripts
zh_cn: 执行模块作为脚本

source: Execution Context
zh_cn: 执行上下文

source: Existence checking operators
zh_cn: 存在检查操作符

source: Explicit Unicode Literal for Python 3.3
zh_cn: Python 3.3 的显式 Unicode 文本

source: Explicit bootstrapping of pip in Python installations
zh_cn: 在 Python 安装中显式引导 pip

source: Explicit is better than implicit.
zh_cn: 明了优于隐晦。

source: Extended HTTP functionality and WebDAV
zh_cn: 扩展的 HTTP 功能和 WebDAV

source: Extended Iterable Unpacking
zh_cn: 扩展的 Iterable 解包

source: Extended Print Statement
zh_cn: 扩展打印语句

source: Extension Module Initialization and Finalization
zh_cn: 扩展模块初始化和定稿

source: Extensions to the pickle protocol
zh_cn: 对 pickle 协议的扩展

source: Externally Maintained Packages
zh_cn: 外部维护包

source: Faster evolution of the Python Standard Library
zh_cn: Python 标准库的更快发展

source: Feature Requests
zh_cn: 功能请求

source: Final Grammar for Literal String Interpolation
zh_cn: 文字串插值的最终语法

source: Finished PEPs (done, implemented in code repository)
zh_cn: 完成的 PEPs （完成，在代码库中实现）

source: Flat is better than nested.
zh_cn: 扁平优于嵌套。

source: Flexible String Representation
zh_cn: 灵活的字符串表示

source: Format Specifier for Thousands Separator
zh_cn: 千位分隔符的格式说明符

source: Function Annotations
zh_cn: 函数注释

source: Function Attributes
zh_cn: 函数属性

source: Function Signature Object
zh_cn: 函数签名对象

source: General purpose string interpolation
zh_cn: 通用字符串插值

source: Generator Expressions
zh_cn: 生成器表达式

source: Generator-sensitivity for Context Variables
zh_cn: 上下文变量的发生器灵敏度

source: Generators Attributes and Exceptions
zh_cn: 生成器属性和异常

source: Guidelines for Handling Bug Reports
zh_cn: 处理 Bug 报告指南

source: Guidelines for Language Evolution
zh_cn: 语言进化指南

source: HTTPS verification migration tools for Python 2.7
zh_cn: 用于 Python 2.7 的 HTTPS 验证迁移工具

source: Historical Meta-PEPs and Informational PEPs
zh_cn: 历史 Meta-PEPs 和信息 PEPs

source: How to Change Python's Grammar
zh_cn: 如何更改 Python 的语法

source: IDLE Enhancement Exception for All Branches
zh_cn: 所有分支的 IDLE 增强异常

source: IEEE 754 Floating Point Special Values
zh_cn: IEEE 754 浮点特殊值

source: IP Address Manipulation Library for the Python Standard Library
zh_cn: Python 标准库的 IP 地址操作库

source: If the implementation is easy to explain, it may be a good idea.
zh_cn: 如果实现容易解释，那可能是个好主意。

source: If the implementation is hard to explain, it's a bad idea.
zh_cn: 如果实现难以解释，这一定是个坏主意。

source: Immutable Bytes and Mutable Buffer
zh_cn: 不可变字节和可变缓冲区

source: Implement context suppression with exception attributes
zh_cn: 使用异常属性实现上下文抑制

source: Implicit Namespace Packages
zh_cn: 隐式命名空间包

source: Import Modules from Zip Archives
zh_cn: 从 Zip 档案导入模块

source: Import on Case-Insensitive Platforms
zh_cn: 在不区分大小写的平台上导入

source: Imports: Multi-Line and Absolute/Relative
zh_cn: Imports: 多行和 绝对/相对

source: Improved Encapsulation of Import State
zh_cn: 改进了 import 状态的封装

source: Improving Python ZIP Application Support
zh_cn: 改进 Python ZIP 应用程序支持

source: In the face of ambiguity, refuse the temptation to guess.
zh_cn: 面对模棱两可，拒绝随意猜测。

source: Including mock in the Standard Library
zh_cn: 包括模拟标准库

source: Inclusion of implicit pip bootstrap in Python installation
zh_cn: 在 Python 安装中包含隐式 pip 引导

source: Instance Descriptors
zh_cn: 实例描述符

source: Integer Literal Support and Syntax
zh_cn: 整数文字支持和语法

source: Integer for-loops
zh_cn: 整数 for 循环

source: Interpretation of multiline string constants
zh_cn: 多行字符串常量的解释

source: Introducing Abstract Base Classes
zh_cn: 引入抽象基类

source: Introducing Roles
zh_cn: 引入 Roles

source: Iterators
zh_cn: 迭代器

source: Key-Sharing Dictionary
zh_cn: 密钥分享字典

source: Keyword-Only Arguments
zh_cn: 仅关键字参数

source: Labeled break and continue
zh_cn: 标记中断和继续

source: List Comprehensions
zh_cn: 列表解析

source: Literal String Interpolation
zh_cn: 字符串插值

source: Literature Overview for Type Hints
zh_cn: 类型提示的文献概述

source: Local Time Disambiguation
zh_cn: 当地时间消除歧义

source: Locale-Independent Float/String Conversions
zh_cn: 与区域无关的浮点数/字符串转换

source: Lockstep Iteration
zh_cn: 锁步迭代

source: Logging Usage in the Standard Library
zh_cn: 标准库中的日志使用

source: Long time Pythoneer Tim Peters succinctly channels the BDFL's guiding principles for Python's design into 20 aphorisms, only 19 of which have been written down.
zh_cn: 长期以来，Pythoneer Tim Peters 简洁地将 BDFL 的设计指导原则引入 20 个格言中，其中只有 19 个被写下来。

source: Loop Counter Iteration
zh_cn: 循环计数器迭代

source: Loop Counter Iteration with range and xrange
zh_cn: range 和 xrange 循环计数器迭代

source: Main module explicit relative imports
zh_cn: 主模块显式相对导入

source: Make newly created file descriptors non-inheritable
zh_cn: 使新创建的文件描述符不可继承

source: Make os.urandom() blocking on Linux
zh_cn: 在 Linux 上设置 os.urandom() 阻塞

source: Make the Python Launcher aware of virtual environments
zh_cn: 让 Python 启动器知道虚拟环境

source: Making Classes Look More Like Types
zh_cn: 让类更像类型

source: Making PyObject_HEAD conform to standard C
zh_cn: 使 PyObject_HEAD 符合标准 C

source: Making Types Look More Like Classes
zh_cn: 让类型更像类

source: Merging Unladen Swallow into CPython
zh_cn: 将 Unladen Swallow 合并到 CPython 中

source: Meta-PEPs (PEPs about PEPs or Processes)
zh_cn: Meta-PEPs (关于 PEPs 或过程的 PEPs)

source: Metaclasses in Python 3000
zh_cn: Python 3000 中的元类

source: Metadata for Python Software Packages
zh_cn: Python 软件包的元数据

source: Metadata for Python Software Packages 1.2
zh_cn: Python 软件包的元数据 1.2

source: Metadata for Python Software Packages 1.3
zh_cn: Python 软件包的元数据 1.3

source: Metadata for Python Software Packages 2.0
zh_cn: Python 软件包的元数据 2.0

source: Metadata for Python Software Packages v1.1
zh_cn: Python 软件包的元数据 1.1

source: Migrate CPython to Git and GitLab
zh_cn: 将 CPython 迁移到 Git 和 GitLab

source: Migrate CPython to Git, Github, and Phabricator
zh_cn: 将 CPython 迁移到 Git，Github 和 Phabricator

source: Migrating from Subversion to Mercurial
zh_cn: 从 Subversion 迁移到 Mercurial

source: Migrating from hg.python.org to GitHub
zh_cn: 从 hg.python.org 迁移到 GitHub

source: Migrating the Python CVS to Subversion
zh_cn: 将 Python CVS 迁移到 Subversion

source: Migrating to Python 3 as the default online documentation
zh_cn: 迁移到 Python 3 作为默认在线文档

source: Migration of dict iteration code to Python 3
zh_cn: 字典迭代代码迁移到 Python 3

source: Minor API improvements for binary sequences
zh_cn: 二进制序列的小 API 改进

source: Mirroring infrastructure for PyPI
zh_cn: 镜像 PyPI 的基础结构

source: Miscellaneous Python 3.0 Plans
zh_cn: 杂项 Python 3.0 计划

source: Module Repository Upload Mechanism
zh_cn: 模块库上传机制

source: Module Version Numbers
zh_cn: 模块版本号

source: Module __getattr__ and __dir__
zh_cn: 模块 __getattr__ 和 __dir__

source: More Flexible Loop Control
zh_cn: 更灵活的循环控制

source: Multi-dimensional Arrays
zh_cn: 多维数组

source: Multi-phase extension module initialization
zh_cn: 多相扩展模块初始化

source: Multiple Interpreters in the Stdlib
zh_cn: Stdlib 中的多个解释器

source: Namespace Packages
zh_cn: 命名空间包

source: Namespaces are one honking great idea -- let's do more of those!
zh_cn: 命名空间是一个很棒的主意，让我们做更多的事情吧！

source: Naming conventions and recipes related to packaging
zh_cn: 与包相关的命名约定和配方

source: Network Security Enhancements for Python 2.7.x
zh_cn: 针对 Python 2.7.x 的网络安全增强功能

source: New I/O
zh_cn: 新的 I/O

source: New Import Hooks
zh_cn: 新的 import 挂钩

source: New Super
zh_cn: 新的 super

source: New release cycle and introducing long-term support versions
zh_cn: 新的发布周期和引入长期支持版本

source: Non-decodable Bytes in System Character Interfaces
zh_cn: 系统字符界面中的不可解码字节

source: Now is better than never.
zh_cn: 虽然一直不做经常要好过匆忙去做，

source: Numeric Kinds
zh_cn: 数字种类

source: Numerical Index
zh_cn: 数字索引

source: Object Adaptation
zh_cn: 对象适应

source: Omit printing newline after newline
zh_cn: 换行之后省略打印换行符

source: Open PEPs (under consideration)
zh_cn: 打开的 PEPs (考虑中)

source: Optimized Access to Module Namespaces
zh_cn: 优化对模块命名空间的访问

source: Optimizing Global Variable/Attribute Access
zh_cn: 优化全局变量/属性访问

source: Optimizing access to globals
zh_cn: 优化对全局的访问

source: Other Informational PEPs
zh_cn: 其他信息的 PEPs

source: Overloadable Boolean Operators
zh_cn: 可重载布尔运算符

source: Overloading, Generic Functions, Interfaces, and Adaptation
zh_cn: 重载，泛型函数，接口和适配器

source: PEP Purpose and Guidelines
zh_cn: PEP 目的和指导方针

source: PYC Repository Directories
zh_cn: PYC 存储库目录

source: Package Index Name Retention
zh_cn: 包索引名称保留

source: Package Index and Metadata for Distutils
zh_cn: 打包索引和 Distutils 的元数据

source: Partial Function Application
zh_cn: 部分功能应用

source: Path - Object oriented filesystem paths
zh_cn: 路径 - 面向对象的文件系统路径

source: Per user site-packages directory
zh_cn: 每个用户 site-packages 目录

source: Pgen Module for Python
zh_cn: Python 的 Pgen 模块

source: Pickle protocol version 4
zh_cn: Pickle 协议版本 4

source: Postfix type declarations
zh_cn: 后缀类型声明

source: Postponed Evaluation of Annotations
zh_cn: 推迟评估注释

source: Prefixing sys.path by command line option
zh_cn: 通过命令行选项添加 sys.path 前缀

source: Preserving Class Attribute Definition Order
zh_cn: 保留类的属性定义顺序

source: Preserving the order of \*\*kwargs in a function.
zh_cn: 在函数中保存 \*\*kwargs 的顺序

source: Procedure for Adding New Modules
zh_cn: 添加新模块的步骤

source: Procedure for Backwards-Incompatible Changes
zh_cn: 向后不兼容的更改过程

source: Procedure for reviewing and improving standard library modules
zh_cn: 审查和改进标准库模块的程序

source: Programming by Contract for Python
zh_cn: Python 合同编程

source: Protecting cleanup statements from interruptions
zh_cn: 保护清理语句不受干扰

source: Provisional packages in the Python standard library
zh_cn: Python 标准库中的临时包

source: Pure Python/C Accelerator Module Compatibility Requirements
zh_cn: 原生 Python/C 加速器模块兼容性要求

source: Python 1.6 Release Schedule
zh_cn: Python 1.6 发布计划

source: Python 2.0 Release Schedule
zh_cn: Python 2.0 发布计划

source: Python 2.1 Release Schedule
zh_cn: Python 2.1 发布计划

source: Python 2.2 Release Schedule
zh_cn: Python 2.2 发布计划

source: Python 2.3 Release Schedule
zh_cn: Python 2.3 发布计划

source: Python 2.4 Release Schedule
zh_cn: Python 2.4 发布计划

source: Python 2.5 Release Schedule
zh_cn: Python 2.5 发布计划

source: Python 2.6 and 3.0 Release Schedule
zh_cn: Python 2.6 和 3.0 发布计划

source: Python 2.7 Release Schedule
zh_cn: Python 2.7 发布计划

source: Python 2.8 Un-release Schedule
zh_cn: Python 2.8 非发布计划

source: Python 3.1 Release Schedule
zh_cn: Python 3.1 发布计划

source: Python 3.2 Release Schedule
zh_cn: Python 3.2 发布计划

source: Python 3.3 Release Schedule
zh_cn: Python 3.3 发布计划

source: Python 3.4 Release Schedule
zh_cn: Python 3.4 发布计划

source: Python 3.5 Release Schedule
zh_cn: Python 3.5 发布计划

source: Python 3.6 Release Schedule
zh_cn: Python 3.6 发布计划

source: Python 3.7 Release Schedule
zh_cn: Python 3.7 发布计划

source: Python Advanced Library
zh_cn: Python 高级库

source: Python Bytecode Verification
zh_cn: Python 的字节码验证

source: Python Database API Specification v1.0
zh_cn: Python 数据库 API 规范 v1.0

source: Python Database API Specification v2.0
zh_cn: Python 数据库 API 规范 v2.0

source: Python Documentation Translations
zh_cn: Python 文档翻译

source: Python Interface Syntax
zh_cn: Python 接口语法

source: Python Online Help
zh_cn: Python 在线帮助

source: Python Synchronize/Asynchronize Block
zh_cn: Python 同步/异步块

source: Python Unicode Integration
zh_cn: Python Unicode 集成

source: Python Virtual Environments
zh_cn: Python 虚拟环境

source: Python Web Server Gateway Interface v1.0
zh_cn: Python Web 服务器网关接口 v1.0

source: Python Web Server Gateway Interface v1.0.1
zh_cn: Python Web 服务器的网关接口 v1.0.1

source: Python Web3 Interface
zh_cn: Python Web3 接口

source: Python launcher for Windows
zh_cn: Windows 的 Python 启动器

source: Python registration in the Windows registry
zh_cn: 在 Windows 注册表中注册 Python

source: Qualified Names for Modules
zh_cn: 模块的限定名

source: Qualified name for classes and functions
zh_cn: 类和函数的限定名

source: Raising Exceptions in Python 3000
zh_cn: 在 Python 3000 中引发异常

source: Range Literals
zh_cn: 范围文字

source: Readability counts.
zh_cn: 可读性很重要。

source: Reject Foolish Indentation
zh_cn: 拒绝愚蠢的缩进

source: Removal of Tuple Parameter Unpacking
zh_cn: 去除元组参数拆包

source: Removal of the PyPI Mirror Authenticity API
zh_cn: 删除 PyPI 镜像真实性 API

source: Removal of the PyPI Mirror Auto Discovery and Naming Scheme
zh_cn: 删除 PyPI 镜像自动发现和命名方案

source: Remove Backslash Continuation
zh_cn: 删除反斜杠继续

source: Remove Implicit String Concatenation
zh_cn: 删除隐式字符串连接

source: Removing External Hosting Support on PyPI
zh_cn: 删除 PyPI 上的外部托管支持

source: Removing support for little used platforms
zh_cn: 删除对很少使用的平台的支持

source: Renaming iterator.next() to iterator.__next__()
zh_cn: 重命名 iterator.next() 为 iterator.__next__()

source: Required Superclass for Exceptions
zh_cn: 异常的必需超类

source: Restructuring the CPython startup sequence
zh_cn: 重新构建 CPython 启动顺序

source: Retry system calls failing with EINTR
zh_cn: 重试系统调用与 EINTR 失败

source: Revamping dict.keys(), .values() and .items()
zh_cn: 修改 dict.keys(), .values() 和 .items()

source: Reverse Iteration
zh_cn: 反向迭代

source: Revising the buffer protocol
zh_cn: 修改缓冲区协议

source: Reworking Python's Numeric Model
zh_cn: 重新编写 Python 的数字模型

source: Reworking the Coercion Model
zh_cn: 改造强制模式

source: Reworking the OS and IO exception hierarchy
zh_cn: 修改操作系统和 IO 异常层次结构

source: Rich Comparisons
zh_cn: 丰富的比较

source: Rich comparison chaining
zh_cn: 丰富的比较链接

source: Running extension modules using the -m option
zh_cn: 使用 -m 选项运行扩展模块

source: Safe object finalization
zh_cn: 安全的对象 finalization

source: Sample Plaintext PEP Template
zh_cn: 示例纯文本 PEP 模板

source: Sample reStructuredText PEP Template
zh_cn: reStructuredText PEP 模板示例

source: Secure and interchangeable hash algorithm
zh_cn: 安全可互换的散列算法

source: Security transparency in the Python runtime
zh_cn: Python 运行时的安全透明度

source: Show DeprecationWarning in __main__
zh_cn: 在 __main__ 中显示 DeprecationWarning

source: Simple Coroutines via SuspendIteration
zh_cn: 简单的协程通过 SuspendIteration

source: Simple Generators
zh_cn: 简化生成器

source: Simple Implicit Lambda
zh_cn: 简单的隐式 Lambda

source: Simple Iterator for ints
zh_cn: 整数的简单迭代器

source: Simple Repository API
zh_cn: 简单的仓库 API

source: Simple input built-in in Python 3000
zh_cn: 简单的输入内置在 Python 3000 中

source: Simple is better than complex.
zh_cn: 简单优于复杂。

source: Simpler String Substitutions
zh_cn: 简化字符串替换
